/* Реално число
 *
 * <реално_число> ::= <цяло_число>.<цяло_число_без_знак>
 * <цяло_число> ::= [+|-]<цяло_число_без_знак>
 * <цяло_число_без_знак> ::= <цифра>|{<цифра>}
 * <цифра> ::= 0|1|2| ... |9
 */

 /* Име на променлива
  *
  * <име_на_променлива> ::= <буква_или_подчертавка>{<буква_подчертавка_или_цифра}
  * <буква_или_подчертавка> ::= <буква>|<подчертавка>
  * <буква_подчертавка_или_цифра> ::= <буква>|<подчертавка>|<цифра>
  * <буква> ::= a|b|c| ... |x|y|z|A|B|C| ... |X|Y|Z
  * <подчертавка> ::= _
  * <цифра> ::= 0|1|2| ... |9
  */
