#include <iostream>
#include <iomanip>  // нужна библиотека за работа с манипулатори

using namespace std;

int main()
{
    cout << 2.0 << endl;
    cout << showpoint << 2.0 << endl;  // задължително извеждане на десетичната
                                       // точка, ако числото е реално(по-точно
                                       // рационално)

    cout << showpos << 2 << endl;  // извежда знака на числото, дори когато то
                                   // е положително

    cout << 12.3456789 << endl;  // по подразбиране рационалните числа се извеждат закръглени
                                 // до 6-тата цифра, броейки от НАЧАЛОТО на числото

    cout << fixed << 12.3456789 << endl;  // сега се извеждат закръглени до 6-тата
                                          // цифра, броейки след точката

    cout << scientific << 12.3456789 << endl;  // сега се извежда във вида b0.b1b2...bn,
                                               // където b0...bn са цифри, закръглено до
                                               // 6 цифри СЛЕД точката, последвано от
                                               // 'е[+|-]<степен>', което означава 10 на
                                               // степен <степен>

    cout << setprecision(4) << 12.3456789 << endl;  // променяме закръглянето при
                                                    // извеждане на рационалните числа
                                                    // от 6(по подразбиране) на 4

    return 0;
}
